import React from 'react';
import { Row, Col, Container } from "react-bootstrap"
import Document from './Document'

export default class Documents extends React.Component {
  constructor(props) {
    super(props);
    this.state = {
      groupByCount: 4,
      resourses: [
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        },
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        },
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        },
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        }
        ,
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        }
        ,
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        }
        ,
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        }
        ,
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        },
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        }
      ]
    }
  };
  gropBy = (resourse, count) => {
    const result = []
    for (let i = 0; i < resourse.length; i += count) {
      const elementsInRow = []

      for (let j = i; j < resourse.length && j < i + count; j += 1) {
        elementsInRow.push(resourse[j])
      }
      result.push(
        <Row>
          {elementsInRow}
        </Row>
      )
    }
    return result
  }

  eachResourse = (resourse, index) => {
    return (
      <Col>
        <Document show={1}
          author={resourse.author}
          title={resourse.title}
          content={resourse.content}>
        </Document >
      </Col >
    );
  };

  Results = () => (
    <Container fluid>
      {this.gropBy(this.state.resourses.map(this.eachResourse), this.state.groupByCount)}
    </Container >
  )

  render() {
    let results

    if (this.props.show) {
      results = this.Results()
    } else {
      results = null
    }

    return results
  }
}

