import React from 'react';
import { Row, Col, Container } from "react-bootstrap"
import Document from './Document'

export default class Documents extends React.Component {
  constructor(props) {
    super(props);
    this.state = {
      groupByCount: 4,
      // Робоча програма
      // resourses: [
      //   {
      //     author: "старший викладач кафедри АПЕПС, Дацюк Оксана Антонівна",
      //     title: "Робоча програма кредитного модуля Бази даних - 1",
      //     content: "Вивчення кредитного модуля спирається на знання, отримані за програмою попередніх років навчання на першому рівні вищої освіти ступеня “бакалавр” спеціальності “ Інженерія програмного забезпечення ”",
      //   }
      // ]

      //============================  ТЕЗИ
      // resourses: [
      //   {
      //     author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
      //     title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
      //     content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
      //   },
      //   {
      //     author: "Аспірант Кайдик Б.В.; провідний інженер  -  Драпей С.С. ",
      //     title: "ВЗАЄМОЗВ'ЯЗОК МІЖ ЯДЕРНОЮ ТА ФІЗИЧНОЮ ЯДЕРНОЮ БЕЗПЕКОЮ",
      //     content: "В Україні не зовсім стабільна економічна та політична ситуація, що підсилюється"
      //   },
      //   {
      //     author: "Магістрант 2 курсу, гр. ТЯ-71мн Заяць М.С.",
      //     title: "ОЦІНКА РАДІАЦІЙНИХ НАСЛІДКІВ ПРИ ВАЖКИХ АВАРІЯХ НА АЕС",
      //     content: "Проблеми надійності, безпеки експлуатації енергоблоків АЕС при продовженні"
      //   },
      //   {
      //     author: "Магістрант 2 курсу, гр. ТЯ-71мн Кальян Г.А.",
      //     title: "МАТЕМАТИЧНЕ МОДЕЛЮВАННЯ НЕЙТРОННОЇ АКТИВНОСТІ (В ПОТЕНЦІЙНО ЯДЕРНО-НЕБЕЗПЕЧНОМУ СКУПЧЕННІ) ВСЕРЕДИНІ КОМПЛЕКСУ НБК-ОУ",
      //     content: "Поточний стан ОУ кваліфікується як «зруйнований запроектною аварією 4-й блок"
      //   }
      // ]

      //================  Бакалавр
      // resourses: [
      //   {
      //     author: "студент 4 курсу, групи ТВз-51 Кисельов Юрій Юрійович ",
      //     title: "Автоматизована система розрахунку вартості програмного забезпечення",
      //     content: `Метою роботи є дослідження існуючих методів та моделей оцінки вартості
      //     програмного забезпечення, практичне оволодіння прийомами та навичками
      //     створення оцінки програмних систем та проектів, розробка автоматизованої системи
      //     розрахунку вартості програмного забезпечення, з використанням засобів оцінки
      //     вартості програмного продукту`,
      //   },
      //   {
      //     author: `студент 4 -курсу, групи ТВз-51 -
      //     Іванів Андрій Петрович`,
      //     title: `Інструментальні засоби супроводження реєстру інформаційних
      //     ресурсів в хмарному середовищі`,
      //     content: `Мета роботи — проаналізувати існуючі реєстри інформаційних ресурсів,
      //     розробити схему об’єктів даних сховища, передбачити методи управління доступу до
      //     інформаційних ресурсів в хмарному середовищі.`,
      //   },
      //   {
      //     author: `студент 4 курсу, групи ТВ-з51 Дормідонтов Валентин Сергійович`,
      //     title: `Web-система моніторингу довкілля за аналізом набору зображень`,
      //     content: `Дана дипломна робота присвячена розробці web-системи по моніторингу
      //     довкілля за набором зображень на прикладі завантаженого фото та розпізнавання на
      //     ньому об'єктів та їх пошкоджень.`,
      //   }
      // ]

      //================  Магистер
      // resourses: [
      //   {
      //     author: `студент (-ка) 6 курсу, групи ТМ-81мп
      //     Гумінський Артем Миколайович`,
      //     title: `Система супроводження та аналізу навчального процесу
      //     спеціалістів науково-педагогічних кадрів вищої кваліфікації`,
      //     content: `Існуючі на ринку програмні продукти, як правило, слабо
      //     враховують яскраво виражену галузеву специфіку ринку освіти. До того ж, через брак
      //     ресурсів проекти комплексної автоматизації в ВНЗ часто гальмуються і не доводяться
      //     до кінця.`,
      //   },
      //   {
      //     author: `студент 6 курсу, групи ТР-81МП
      //     Будько Дмитро Ігорович`,
      //     title: `Мікросервіс обробки геоінформаційних даних в середовищі
      //     хмарних обчислень`,
      //     content: `В задачах геоінформаційної інженерії все більше з’являється задач, які
      //     потребують значної обчислювальної потужності, та потребують правильного
      //     структурування системи у зв’язку зі складністю проектування системи.`,
      //   },
      //   {
      //     author: `студент 6-го курсу, групи ТМ-81мп
      //     Яшин Андрій Сергійович`,
      //     title: `Програмна реалізація людино-машинного інтерфейсу для
      //     візуалізації KNX інсталяцій`,
      //     content: `У сучасному світі кожен очікує більшого комфорту та зручності, як вдома, так і на
      //     роботі. В даний час KNX - одне з найпоширеніших рішень для використання в середніх
      //     і великих системах автоматизації в будинках, офісах та комерційних приміщеннях. `,
      //   }
      // ]

    }
  };
  gropBy = (resourse, count) => {
    const result = []
    for (let i = 0; i < resourse.length; i += count) {
      const elementsInRow = []

      for (let j = i; j < resourse.length && j < i + count; j += 1) {
        elementsInRow.push(resourse[j])
      }
      result.push(
        <Row>
          {elementsInRow}
        </Row>
      )
    }
    return result
  }

  eachResourse = (resourse, index) => {
    console.log(resourse)
    return (
      <Col>
        <Document show={1}
          author={resourse.author[0] && resourse.author[0].fullName}
          title={resourse.title && resourse.title.title}
          content='{resourse.content}'>
        </Document >
      </Col >
    );
  };

  Results = () => (
    <Container fluid>
      {this.gropBy(this.props.data.data.findResourceBy.map(this.eachResourse), this.state.groupByCount)}
    </Container >
  )

  render() {
    let results

    if (this.props.show) {
      results = this.Results()
    } else {
      results = null
    }

    return results
  }
}
