import React from 'react';
import { Row, Col, Container } from "react-bootstrap"
import Document from './Document'

export default class Documents extends React.Component {
  constructor(props) {
    super(props);
    this.state = {
      groupByCount: 4,
      resourses: [
               {
                 author: "2019/ 2020",
                 title: "122 Комп'ютерні науки",
                 content: "Комп'ютерний моніторинг та геометричне моделювання процесів та систем ",
                 content1: "бакалавр",
                 content2: "Автоматизації проектування енергетичних процесів і систем"
               },
               {
                 author: "2019/ 2020",
                 title: "121 Інженерія програмного забезпечення ",
                 content: "Інженерія програмного забезпечення   розподілених систем",
                 content1: "бакалавр",
                 content2: "Автоматизації проектування енергетичних процесів і систем"
               },
               {
                 author: "2018/ 2019",
                 title: "122 Комп'ютерні науки",
                 content: "Комп'ютерний моніторинг та геометричне моделювання процесів та систем ",
                 content1: "бакалавр",
                 content2: "Автоматизації проектування енергетичних процесів і систем"
               },
             ]


  //============================ РОБОЧА ПРОГРАМА
  /*    resourses: [
           {
             author: "старший викладач кафедри АПЕПС, Дацюк Оксана Антонівна",
             title: "БАЗИ ДАНИХ-1",
             content: "перший  (бакалаврський)",
             content1: "121 Інженерія програмного забезпечення",
             content2: "Інженерія програмного забезпечення   розподілених систем"
           },
           {
             author: "доцент, Аушева Наталія Миколаївна",
             title: "ГЕОМЕТРИЧНЕ МОДЕЛЮВАННЯ-1",
             content: "перший  (бакалаврський)",
             content1: "121 Інженерія програмного забезпечення",
             content2: "Інженерія програмного забезпечення   розподілених систем"
           },
           {
             author: "асистент., Молодід Олександр Кирилович",
             title: "ЧИСЕЛЬНІ МЕТОДИ-1",
             content: "перший  (бакалаврський)",
             content1: "122 Комп'ютерні науки'",
             content2: "Комп'ютерний моніторинг та геометричне моделювання поцесів та систем"
           },
         ]  */
  //============================  ТЕЗИ
  /*    resourses: [
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        },
        {
          author: "Аспірант Кайдик Б.В.; провідний інженер  -  Драпей С.С. ",
          title: "ВЗАЄМОЗВ'ЯЗОК МІЖ ЯДЕРНОЮ ТА ФІЗИЧНОЮ ЯДЕРНОЮ БЕЗПЕКОЮ",
          content: "В Україні не зовсім стабільна економічна та політична ситуація, що підсилюється"
        },
        {
          author: "Магістрант 2 курсу, гр. ТЯ-71мн Заяць М.С.",
          title: "ОЦІНКА РАДІАЦІЙНИХ НАСЛІДКІВ ПРИ ВАЖКИХ АВАРІЯХ НА АЕС",
          content: "Проблеми надійності, безпеки експлуатації енергоблоків АЕС при продовженні"
        },
        {
          author: "Магістрант 2 курсу, гр. ТЯ-71мн Кальян Г.А.",
          title: "МАТЕМАТИЧНЕ МОДЕЛЮВАННЯ НЕЙТРОННОЇ АКТИВНОСТІ (В ПОТЕНЦІЙНО ЯДЕРНО-НЕБЕЗПЕЧНОМУ СКУПЧЕННІ) ВСЕРЕДИНІ КОМПЛЕКСУ НБК-ОУ",
          content: "Поточний стан ОУ кваліфікується як «зруйнований запроектною аварією 4-й блок"
        }
<<<<<<< Updated upstream
        ,
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        }
        ,
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        }
        ,
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        }
        ,
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        },
        {
          author: "Студент 1 курсу, гр. ТЯ-81 Дзерун М.С.",
          title: "ПРО ВИКОРИСТАННЯ НЕЛІНІЙНОСТІ ХАРАКТЕРИСТИКИ МАЯТНИКОВОЇ КОЛИВАЛЬНОЇ СИСТЕМИ ДЛЯ ЗНАХОДЖЕННЯ ПОЧАТКОВИХ УМОВ ЇЇ РУХУ",
          content: "З метою скорочення часу знаходження початкових умов руху коливальних систем"
        }
      ]
=======
      ]   */
>>>>>>> Stashed changes
    }
  };
  gropBy = (resourse, count) => {
    const result = []
    for (let i = 0; i < resourse.length; i += count) {
      const elementsInRow = []

      for (let j = i; j < resourse.length && j < i + count; j += 1) {
        elementsInRow.push(resourse[j])
      }
      result.push(
        <Row>
          {elementsInRow}
        </Row>
      )
    }
    return result
  }

  eachResourse = (resourse, index) => {
    return (
      <Col>
        <Document show={1}
          author={resourse.author}
          title={resourse.title}
          content={resourse.content}
          content1={resourse.content1}
          content2={resourse.content2}>
        </Document >
      </Col >
    );
  };

  Results = () => (
    <Container fluid>
      {this.gropBy(this.state.resourses.map(this.eachResourse), this.state.groupByCount)}
    </Container >
  )

  render() {
    let results

    if (this.props.show) {
      results = this.Results()
    } else {
      results = null
    }

    return results
  }
}
